{
  "sources": [
    {
      "title": "Tynan | Life Outside the Box",
      "feedUrl": "http://feeds.feedburner.com/tynan",
      "siteUrl": "http://tynan.com",
      "articles": [
        {
          "id": "http://tynan.com/you-have-more-options-when-youre-weird",
          "author": "Tynan",
          "description": "In many ways my life is very weird. Sometimes when I'm about to make a statement like that I try to think of a relatable example of how I'm not weird in some way, but it's hard to come up with one. I wear clothes like everyone else... except I only have one set. I sleep",
          "link": "http://tynan.com/you-have-more-options-when-youre-weird",
          "publishedOn": "2021-05-22T17:24:37.000Z",
          "wordCount": 1669,
          "title": "You Have More Options When You're Weird"
        },
        {
          "id": "http://tynan.com/buying",
          "author": "Tynan",
          "description": "Despite being a pretty severe minimalist for a long time, I think I'm now known a lot for what I buy. I worry about this a little bit sometimes, because I don't think being a great consumer is very meaningful. On the other hand, buying the right things is a good substitu",
          "link": "http://tynan.com/buying",
          "publishedOn": "2021-05-13T15:30:00.000Z",
          "wordCount": 2013,
          "title": "How I Make Purchasing Decisions"
        },
        {
          "id": "http://tynan.com/hilo",
          "author": "Tynan",
          "description": "I don't really consider myself to be a foodie, but the food in Hilo is SO good that it's one of the things I most look forward to every time I visit. I've been to the major Hawaiian islands and have had great food on all of them, but Hilo is definitely in a league of it'",
          "link": "http://tynan.com/hilo",
          "publishedOn": "2021-05-08T20:34:02.000Z",
          "wordCount": 2240,
          "title": "The Best Food in Hilo, Hawaii"
        },
        {
          "id": "http://tynan.com/excellence",
          "author": "Tynan",
          "description": "By strange coincidence, I know a lot of people starting restaurants. Some are friends, some are family members, and some I've just gotten to know because I eat at their restaurants all the time. One is a world class chocolate company, another is a pizza place, another is",
          "link": "http://tynan.com/excellence",
          "publishedOn": "2021-05-02T15:30:00.000Z",
          "wordCount": 1528,
          "title": "Attainable Excellence"
        },
        {
          "id": "http://tynan.com/filter",
          "author": "Tynan",
          "description": "We're all looking for the next thing that we should be doing or paying attention to. Maybe that's even part of why you read this blog. This is a good pursuit of course, but it often seems to me that people don't spend enough time figuring out what they shouldn't be payin",
          "link": "http://tynan.com/filter",
          "publishedOn": "2021-04-23T20:16:10.000Z",
          "wordCount": 1840,
          "title": "Filter More Out"
        }
      ]
    },
    {
      "title": "Mr. Money Mustache",
      "feedUrl": "http://www.mrmoneymustache.com/feed/",
      "siteUrl": "https://www.mrmoneymustache.com",
      "articles": []
    },
    {
      "title": "Drew DeVault's blog",
      "feedUrl": "https://drewdevault.com/feed.xml",
      "siteUrl": "https://drewdevault.com",
      "articles": [
        {
          "id": "https://drewdevault.com/2021/05/19/How-to-write-release-notes.html",
          "author": null,
          "description": "Release notes are a concept most of us are familiar with. When a new software\nrelease is prepared, the release notes tell you what changed, so you understand\nwhat you can expect and how to prepare for the update. They are also\noccasionally used to facilitate conversations:\n\nMany of the people tasked with writing release notes have never found themselves\non that side of the screen before. If that describes you, I would like to offer\nsome advice on how to nail it. Note that this mostly applies to free and ope…",
          "link": "https://drewdevault.com/2021/05/19/How-to-write-release-notes.html",
          "publishedOn": "2021-05-19T00:00:00.000Z",
          "wordCount": 1022,
          "title": "How to write release notes"
        },
        {
          "id": "https://drewdevault.com/2021/05/17/aerc-with-mbsync-postfix.html",
          "author": null,
          "description": "I am the original author of the aerc mail client, though my official\nrelationship with it today is marginal at best. I think that, with hindsight,\nI’ve come to understand that the “always online” approach of aerc’s IMAP\nimplementation is less than ideal. The next email client (which will exist at\nsome point!) will improve on this design, but, since it’s still my favorite\nemail client despite these flaws, they will have to be worked around.\nTo this end, I have updated my personal aerc setup to take advantage…",
          "link": "https://drewdevault.com/2021/05/17/aerc-with-mbsync-postfix.html",
          "publishedOn": "2021-05-17T00:00:00.000Z",
          "wordCount": 780,
          "title": "aerc, mbsync, and postfix for maximum comfy offline email"
        },
        {
          "id": "https://drewdevault.com/2021/05/16/Status-update-May-2021.html",
          "author": null,
          "description": "Hello! This update is a bit late. I was travelling all day yesterday without\ninternet, so I could not prepare these. After my sister and I got vaccinated, I\ntook a trip to visit her at her home in beautiful Hawaii — it felt great\nafter a year of being trapped within these same four walls. I hope you get that\nvaccine and things start to improve for you, too!\nIn SourceHut news, I’ve completed and shipped the first version of the\nbuilds.sr.ht GraphQL API. Another update, implementing the write functionality,\nw…",
          "link": "https://drewdevault.com/2021/05/16/Status-update-May-2021.html",
          "publishedOn": "2021-05-16T00:00:00.000Z",
          "wordCount": 552,
          "title": "Status update, May 2021"
        },
        {
          "id": "https://drewdevault.com/2021/05/14/Pinebook-Pro-review.html",
          "author": null,
          "description": "I received the original Pinebook for free from the good folks at Pine64 a few\nyears ago, when I visited Berlin to work with the KDE developers. Honestly, I\nwas underwhelmed. The performance was abysmal and ARM is a nightmare to work\nwith. For these reasons, I was skeptical when I bought the Pinebook Pro. I have\nalso spoken of my disdain for modern laptops in general before: the state\nof laptops in $CURRENTYEAR is abysmal. As such, I have been using a ThinkPad\nX200, an 11 year old laptop, as my sole laptop f…",
          "link": "https://drewdevault.com/2021/05/14/Pinebook-Pro-review.html",
          "publishedOn": "2021-05-14T00:00:00.000Z",
          "wordCount": 960,
          "title": "Pinebook Pro review"
        },
        {
          "id": "https://drewdevault.com/2021/05/08/Try-not-to-make-unlikable-software.html",
          "author": null,
          "description": "I am writing to you from The Sky. On my flight today, I noticed an example of\n&ldquo;unlikable&rdquo; software — something I&rsquo;ve been increasingly aware of recently\n— inspiring me to pull out my laptop and write. On this plane, there are\ndisplays in the back of each seat which provides entertainment for the person\nseated one row back. Newer planes no longer include these, given that in\n$CURRENTYEAR everyone would just prefer some power for their phone or laptop.\nNevertheless, you can still end up a pla…",
          "link": "https://drewdevault.com/2021/05/08/Try-not-to-make-unlikable-software.html",
          "publishedOn": "2021-05-08T00:00:00.000Z",
          "wordCount": 727,
          "title": "I try not to make unlikable software (and features)"
        },
        {
          "id": "https://drewdevault.com/2021/05/07/godocs.io-six-months-later.html",
          "author": null,
          "description": "We&rsquo;re six months on from forking godoc.org following its upstream\ndeprecation, and we&rsquo;ve made a lot of great improvements since. For those\nunaware, the original godoc.org was replaced with pkg.go.dev, and a redirect was\nset up. The new website isn&rsquo;t right for many projects — one of the most\nglaring issues is the narrow list of software licenses pkg.go.dev will display\ndocumentation for. To continue serving the needs of projects which preferred the\nold website, we forked the project and set…",
          "link": "https://drewdevault.com/2021/05/07/godocs.io-six-months-later.html",
          "publishedOn": "2021-05-07T00:00:00.000Z",
          "wordCount": 508,
          "title": "godocs.io six months later"
        },
        {
          "id": "https://drewdevault.com/2021/04/26/Cryptocurrency-is-a-disaster.html",
          "author": null,
          "description": "This post is long overdue. Let&rsquo;s get it over with.\nHey! If you write a comment about this article online,\n  disclose your stake in cryptocurrency. I will explain why later in this post.\n  For my part, I held &lt;$10,000 USD worth of Bitcoin prior to 2016, plus small\n  amounts of altcoins. I made a modest profit on my holdings. Today my stake in\n  all cryptocurrency is $0.\n\nStarting on May 1st, users of sourcehut&rsquo;s CI service will be required to be on a\npaid account, a change which will affect ab…",
          "link": "https://drewdevault.com/2021/04/26/Cryptocurrency-is-a-disaster.html",
          "publishedOn": "2021-04-26T00:00:00.000Z",
          "wordCount": 1487,
          "title": "Cryptocurrency is an abject disaster"
        }
      ]
    }
  ],
  "cliVersion": "1.7.2"
}