{
  "sources": [
    {
      "title": "Tynan | Life Outside the Box",
      "feedUrl": "http://feeds.feedburner.com/tynan",
      "siteUrl": "https://tynan.com",
      "articles": [
        {
          "id": "https://tynan.com/?p=3544",
          "author": "Tynan",
          "description": "One of the projects I’ve been tinkering with constantly for the past nine months or so that we’ve lived at our new house is home automation. I’ve been into home automation since about 1996 and have had a fully automated house ever since 2003 or so. Even my RV was so automated that it unlocked… Continue reading Home Automation",
          "link": "https://tynan.com/automatichome/",
          "publishedOn": "2021-06-27T21:39:25.000Z",
          "wordCount": 2126,
          "title": "Home Automation"
        },
        {
          "id": "https://tynan.com/?p=3539",
          "author": "Tynan",
          "description": "My live event, Superhuman 4.5, will be held in Las Vegas on August 14th and 15th (with an optional meetup the night before). Reflecting on the changes brought about by the pandemic, one of the things I missed most was doing these Superhuman events. They’re a ton of fun and very gratifying for me to… Continue reading Superhuman 4.5 in August",
          "link": "https://tynan.com/superhuman-4-5-in-august/",
          "publishedOn": "2021-06-20T18:55:28.000Z",
          "wordCount": 1112,
          "title": "Superhuman 4.5 in August"
        },
        {
          "id": "https://tynan.com/?p=3502",
          "author": "tynan",
          "description": "If you read the blog through the web you may notice that, for the first time in about a decade, it looks different. If you get posts by email you hopefully don’t notice anything, but since it’s a whole new system… who knows. A little over nine years ago, my good friend Todd and I… Continue reading Why I Switched Back to WordPress and What I Learned",
          "link": "https://tynan.com/wordpress/",
          "publishedOn": "2021-06-11T20:24:09.000Z",
          "wordCount": 1727,
          "title": "Why I Switched Back to WordPress and What I Learned"
        },
        {
          "id": "https://tynan.com/?p=3488",
          "author": "tynan",
          "description": "It’s no secret that I absolutely love cruising. Every year I organize a few cruises and try to get as many of my friends as possible to join me. The only limit I have on how many days per year I spend at sea is how many days I can convince friends to cruise with… Continue reading How to Get Maximum Enjoyment From Cruises",
          "link": "https://tynan.com/how-to-get-maximum-enjoyment-from-cruises/",
          "publishedOn": "2021-06-06T10:50:00.000Z",
          "wordCount": 1865,
          "title": "How to Get Maximum Enjoyment From Cruises"
        }
      ]
    },
    {
      "title": "Mr. Money Mustache",
      "feedUrl": "http://www.mrmoneymustache.com/feed/",
      "siteUrl": "https://www.mrmoneymustache.com",
      "articles": []
    },
    {
      "title": "Drew DeVault's blog",
      "feedUrl": "https://drewdevault.com/feed.xml",
      "siteUrl": "https://drewdevault.com",
      "articles": [
        {
          "id": "https://drewdevault.com/2021/06/27/You-cant-capture-the-nuance.html",
          "author": null,
          "description": "Check out this text box:\nConsectetur qui consequatur voluptatibus voluptatem sit sint perspiciatis. Eos aspernatur ad laboriosam quam numquam quo. Quia reiciendis illo quo praesentium. Dolor porro et et sit dolorem quisquam totam quae.\nEa molestias a aspernatur dignissimos suscipit incidunt. Voluptates in vel qui quaerat. Asperiores vel sit rerum est ipsam. Odio aut aut voluptate qui voluptatem.\nQuia consequatur provident fugiat voluptatibus consequatur. Est sunt aspernatur velit. Officiis a dolorum accusantium. Sint est ut inventore.\nHere are some of the nuances of using this text box on my operating system\n(Linux) and web browser (Firefox):\nDouble clicking selects a word, and triple-clicking selects the whole line. If\nI double- or triple-click-and-hold, I can drag the mouse to expand the…",
          "link": "https://drewdevault.com/2021/06/27/You-cant-capture-the-nuance.html",
          "publishedOn": "2021-06-27T00:00:00.000Z",
          "wordCount": 996,
          "title": "You can't capture the nuance of my form fields"
        },
        {
          "id": "https://drewdevault.com/2021/06/24/finger-client.html",
          "author": null,
          "description": "This is a short follow-up to the io_uring finger server article posted\nabout a month ago. In the time since, we have expanded our language with a more\ncomplete networking stack, most importantly by adding a DNS resolver. I have\nused these improvements to write a small client implementation of the finger\nprotocol.\nuse fmt;\nuse io;\nuse net::dial;\nuse os;\nuse strings;\n\n@init fn registersvc() void = dial::registersvc(\"tcp\", \"finger\", [], 79);\n@noreturn fn usage() void = fmt::fatal(\"Usage: {} <user>[@<host>]\", os::args[0]);\n\nexport fn main() void = {\n\tif (len(os::args) != 2) usage();\n\n\tconst items = strings::split(os::args[1], \"@\");\n\tdefer free(items);\n\tif (len(items) == 0) usage();\n\n\tconst user = items[0];\n\tconst host = if (len(items) == 1) \"localhost\"\n\t\telse if (len(items) == 2) items[1]\n\t\tel…",
          "link": "https://drewdevault.com/2021/06/24/finger-client.html",
          "publishedOn": "2021-06-24T00:00:00.000Z",
          "wordCount": 686,
          "title": "A finger client"
        },
        {
          "id": "https://drewdevault.com/2021/06/15/Status-update-June-2021.html",
          "author": null,
          "description": "Hiya! Got another status update for you. First, let me share this picture that\nmy dad and I took on our recent astronomy trip (click for full res):\n\nBonus Venus:\n\nSo, what’s new? With SourceHut, there are a few neat goings-on. For one, thanks\nto Michael Forney putting the finishing touches on the patchset, the\nlong-awaited NetBSD image is now available for builds.sr.ht. Also, the initial\nlists.sr.ht GraphQL API design is in place, and Simon Ser is working on a new\nand improved implementation of email discussion parsing for us to use. I’ve also\nredesigned the registration & onboarding flow based on a maintainer/contributor\ndistinction, which should help people understand how sourcehut works a bit\nbetter. Also, as promised, the writable GraphQL API for builds.sr.ht is now\navailable.\nI had been working on a new feature for the secret programming language, but in\nthe course of implementing it, it became clear to me that we need to take a step\nback and do some deep refactoring in the compiler. This will probably occupy us\nfor a couple of months. Even so, some improvements in the standard library have\nbeen made and shall continue to be made. You may have seen a few weeks ago that\nI wrote a finger server in the new language, and there’s a bunch of code\nfor you to read there if you’re interested in learning more.\nI also spent some time this month on Simon’s gamja and soju projects.\nLibera.chat is running an experimental instance of gamja for their webchat,\nand I’ve helped Simon incorporate some of their feedback and apply a layer of\npolish to the client. I’m also working on generalizing soju a bit so that we can\neventually utilize it to offer a hosted IRC bouncer for sr.ht users.\nThat’s all I have to share for now. My foci have been on sourcehut and the\nsecret language, and will continue to be those. I plan on advancing the work on\nthe GraphQL APIs for sr.ht and ideally shipping an initial version of the\nlists.sr.ht API in a few weeks. I’ll share more news about the new language when\nit’s ready. Until next time!",
          "link": "https://drewdevault.com/2021/06/15/Status-update-June-2021.html",
          "publishedOn": "2021-06-15T00:00:00.000Z",
          "wordCount": 588,
          "title": "Status update, June 2021"
        },
        {
          "id": "https://drewdevault.com/2021/06/14/Provided-as-is-without-warranty.html",
          "author": null,
          "description": "The MIT license contains the following text, in all uppercase no less:\nTHE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nThe BSD licenses, GPL family of licenses, Apache 2.0, Mozilla Public License,\nand likely any other license you’d care to name, have similar clauses of their\nown. It’s worth taking a moment to consider the implications of this statement\nand what it says about the social aspects of free and open source software.\nMany people who rely on free and open source software feel entitled to some\ndegree of workitude or support from the developers, or think that the developers\nhave a responsibility to provide good maintenance, or any …",
          "link": "https://drewdevault.com/2021/06/14/Provided-as-is-without-warranty.html",
          "publishedOn": "2021-06-14T00:00:00.000Z",
          "wordCount": 867,
          "title": "Provided \"as is\", without warranty of any kind"
        },
        {
          "id": "https://drewdevault.com/2021/06/07/The-Netherlands.html",
          "author": null,
          "description": "I had been planning a move to the Netherlands for a while, at least until a\nlarge COVID-shaped wrench was thrown into the gears. However, I was fully\nvaccinated by early April, and there are signs of the border opening up now, so\nmy plans have been slowly getting back on track. I sent off my visa application\ntoday, and assuming I can navigate the pandemic-modified procedures, I should be\nable to make my move fairly soon. It’s a little bit intimidating, but I am\nlooking forward to it!\nQuick note: I am looking for temporary housing in NL; somewhere I can stay for\n6-12 months with a permanent mailing address for receiving immigration-related\ndocuments. I would prefer to rent out a room than to use some kind of commercial\naccommodation, to be certain that I can receive mail from the immigratio…",
          "link": "https://drewdevault.com/2021/06/07/The-Netherlands.html",
          "publishedOn": "2021-06-07T00:00:00.000Z",
          "wordCount": 1096,
          "title": "I will be moving to the Netherlands"
        },
        {
          "id": "https://drewdevault.com/2021/05/30/Come-build-your-project.html",
          "author": null,
          "description": "Do you have a new systems programming project on your todo list? If you’re\nfeeling adventurous, I would like you to give it a crack in our new systems\nprogramming language, and to use it to drive improvements in the less-developed\nareas of our standard library.\nAre you making a new coreutils implementation? A little OS kernel? A new shell?\nA GUI toolkit? Database system? Web server? Whatever your systems programming\nuse-case, we think that our language is likely to be a good fit for you, and\nyour help in proving that, and spurring development to rise to meet your needs,\nwould be quite welcome.\nHere’s our pitch:\nXXXX is a systems programming language designed to be simple and robust. XXXX\nuses a static type system, manual memory management, and a minimal runtime.\nIt is well-suited to writing operating systems, system tools, compilers,\nnetworking software, and other low-level, high performance tasks.\nYou can get a peek at how it feels by reading about the finger server I wrote\nwith it.\nSounds interesting? Please tell me about your project idea!",
          "link": "https://drewdevault.com/2021/05/30/Come-build-your-project.html",
          "publishedOn": "2021-05-30T00:00:00.000Z",
          "wordCount": 411,
          "title": "Build your project in our new language"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}